nginx/httperf_test_192.168.0.166_bananaPi.txt

以下是以httperf工具，測試Banana Pi上運行nginx server的結果
極限好像是 80 requests/s （每秒可承受80個http請求）

anntony-Lenovo-B590 ~ # httperf --server 192.168.0.166 --port 80 --uri /index.php --rate 100 --num-conn 5000 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=192.168.0.166 --port=80 --uri=/index.php --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=5000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 6

Total: connections 5000 requests 4995 replies 4430 test-duration 55.174 s

Connection rate: 90.6 conn/s (11.0 ms/conn, <=417 concurrent connections)
Connection time [ms]: min 34.9 avg 2515.9 max 8626.2 median 2451.5 stddev 1251.2
Connection time [ms]: connect 449.3
Connection length [replies/conn]: 1.000

Request rate: 90.5 req/s (11.0 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 65.8 avg 80.5 max 88.0 stddev 6.5 (11 samples)
Reply time [ms]: response 411.6 transfer 1684.3
Reply size [B]: header 180.0 content 68007.0 footer 2.0 (total 68189.0)
Reply status: 1xx=0 2xx=4430 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.99 system 51.99 (user 5.4% system 94.2% total 99.6%)
Net I/O: 5353.2 KB/s (43.9*10^6 bps)

Errors: total 570 client-timo 570 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
anntony-Lenovo-B590 ~ # httperf --server 192.168.0.166 --port 80 --uri /index.php --rate 200 --num-conn 10000 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=192.168.0.166 --port=80 --uri=/index.php --rate=200 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 12

Total: connections 9979 requests 9948 replies 3984 test-duration 55.056 s

Connection rate: 181.3 conn/s (5.5 ms/conn, <=1022 concurrent connections)
Connection time [ms]: min 2.9 avg 2667.9 max 10077.3 median 2542.5 stddev 1846.7
Connection time [ms]: connect 173.0
Connection length [replies/conn]: 1.000

Request rate: 180.7 req/s (5.5 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 41.2 avg 72.4 max 119.6 stddev 22.0 (11 samples)
Reply time [ms]: response 1836.2 transfer 655.1
Reply size [B]: header 180.0 content 55407.0 footer 1.0 (total 55588.0)
Reply status: 1xx=0 2xx=3240 3xx=0 4xx=0 5xx=744

CPU time [s]: user 1.36 system 53.41 (user 2.5% system 97.0% total 99.5%)
Net I/O: 3941.5 KB/s (32.3*10^6 bps)

Errors: total 6016 client-timo 2514 socket-timo 0 connrefused 0 connreset 3481
Errors: fd-unavail 21 addrunavail 0 ftab-full 0 other 0
anntony-Lenovo-B590 ~ # httperf --server 192.168.0.166 --port 80 --uri /index.php --rate 80 --num-conn 4000 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=192.168.0.166 --port=80 --uri=/index.php --rate=80 --send-buffer=4096 --recv-buffer=16384 --num-conns=4000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 4000 requests 4000 replies 4000 test-duration 50.055 s

Connection rate: 79.9 conn/s (12.5 ms/conn, <=18 concurrent connections)
Connection time [ms]: min 31.0 avg 84.8 max 243.5 median 78.5 stddev 22.7
Connection time [ms]: connect 10.1
Connection length [replies/conn]: 1.000

Request rate: 79.9 req/s (12.5 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 79.0 avg 79.9 max 80.6 stddev 0.4 (10 samples)
Reply time [ms]: response 26.4 transfer 48.3
Reply size [B]: header 180.0 content 68007.0 footer 2.0 (total 68189.0)
Reply status: 1xx=0 2xx=4000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 17.16 system 32.78 (user 34.3% system 65.5% total 99.8%)
Net I/O: 5327.2 KB/s (43.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
anntony-Lenovo-B590 ~ # httperf --server 192.168.0.166 --port 80 --uri /index.php --rate 80 --num-conn 4000 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=192.168.0.166 --port=80 --uri=/index.php --rate=80 --send-buffer=4096 --recv-buffer=16384 --num-conns=4000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 4000 requests 4000 replies 4000 test-duration 50.055 s

Connection rate: 79.9 conn/s (12.5 ms/conn, <=18 concurrent connections)
Connection time [ms]: min 31.0 avg 84.8 max 243.5 median 78.5 stddev 22.7
Connection time [ms]: connect 10.1
Connection length [replies/conn]: 1.000

Request rate: 79.9 req/s (12.5 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 79.0 avg 79.9 max 80.6 stddev 0.4 (10 samples)
Reply time [ms]: response 26.4 transfer 48.3
Reply size [B]: header 180.0 content 68007.0 footer 2.0 (total 68189.0)
Reply status: 1xx=0 2xx=4000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 17.16 system 32.78 (user 34.3% system 65.5% total 99.8%)
Net I/O: 5327.2 KB/s (43.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
anntony-Lenovo-B590 ~ # httperf --server 192.168.0.166 --port 80 --uri /index.php --rate 80 --num-conn 40000 --num-call 1 --timeout 5
httperf --timeout=5 --client=0/1 --server=192.168.0.166 --port=80 --uri=/index.php --rate=80 --send-buffer=4096 --recv-buffer=16384 --num-conns=40000 --num-calls=1
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 5

Total: connections 40000 requests 40000 replies 40000 test-duration 500.051 s

Connection rate: 80.0 conn/s (12.5 ms/conn, <=97 concurrent connections)
Connection time [ms]: min 33.7 avg 130.4 max 3937.2 median 83.5 stddev 202.9
Connection time [ms]: connect 16.4
Connection length [replies/conn]: 1.000

Request rate: 80.0 req/s (12.5 ms/req)
Request size [B]: 75.0

Reply rate [replies/s]: min 67.6 avg 80.0 max 91.6 stddev 3.0 (100 samples)
Reply time [ms]: response 36.7 transfer 77.3
Reply size [B]: header 180.0 content 68007.0 footer 2.0 (total 68189.0)
Reply status: 1xx=0 2xx=40000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 186.93 system 312.00 (user 37.4% system 62.4% total 99.8%)
Net I/O: 5332.5 KB/s (43.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0